<?php
// Template Name: Blog Page
get_header();
?>
<section class="blog">
    <div class="container">
        <h1 class="blog-title">
            <?php the_title() ?>
        </h1>
        <div class="blog__items">
                <?php
                $paged = (get_query_var('paged')) ? get_query_var('paged') : 1;
                global $wp_query;
                $category = get_queried_object(); // отримуємо об'єкт поточної категорії
                $category_id = $category->term_id;

                $wp_query = new WP_Query(array(
                    'posts_per_page' => 8,
                    'cat' => $category_id,
                    'paged' => get_query_var('paged') ?: 1 // страница пагинации
                ));

                $posts_query = new WP_Query($wp_query);

                if (have_posts()) {
                    while (have_posts()) {
                        the_post();

                        // Отримання часу викладення поста
                        $post_time = get_the_time('U'); // Отримуємо час викладення поста в форматі Unix timestamp

                        // Поточний час
                        $current_time = current_time('U'); // Отримуємо поточний час в форматі Unix timestamp

                        // Різниця між поточним часом і часом викладення поста
                        $time_diff = human_time_diff($post_time, $current_time);

                        // Вивід контенту поста
                        ?>
                        <a href="<?php the_permalink(); ?>" class="all__slide">
                            <div class="all__slide-img">
                                <img src="<?php echo get_the_post_thumbnail_url(); ?>" alt="">
                            </div>
                            <div class="all__slide-text">
                                <div class="all__slide-title">
                                    <?php the_title(); ?>
                                </div>
                                <div class="all__slide-bot">
                                    <div class="all__slide-time">
                                        <?php echo $time_diff; ?> тому
                                    </div>
                                    <div class="all__slide-read">
                                        <svg width="28" height="18" viewBox="0 0 28 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M27.4331 8.80816C27.3929 8.71816 26.4242 6.57118 24.2559 4.40289C22.2475 2.39447 18.7931 0 13.7366 0C8.67998 0 5.22563 2.39447 3.21721 4.40289C1.04892 6.57118 0.0802387 8.71816 0.0399755 8.80816C0.0136067 8.86889 0 8.93439 0 9.00059C0 9.0668 0.0136067 9.1323 0.0399755 9.19303C0.0802387 9.28421 1.04892 11.43 3.21721 13.5983C5.23037 15.6114 8.68116 18 13.7366 18C18.792 18 22.2475 15.6067 24.2559 13.5983C26.4242 11.43 27.3929 9.28421 27.4331 9.19303C27.4595 9.1323 27.4731 9.0668 27.4731 9.00059C27.4731 8.93439 27.4595 8.86889 27.4331 8.80816ZM23.5608 12.9529C20.8288 15.6766 17.5213 17.0526 13.7318 17.0526C9.94234 17.0526 6.63958 15.673 3.90287 12.9529C2.73842 11.7916 1.75913 10.4584 0.999186 9C1.76054 7.54122 2.74145 6.20805 3.90761 5.04711C6.64432 2.32697 9.94708 0.947368 13.7366 0.947368C17.526 0.947368 20.8288 2.32697 23.5655 5.04711C24.7315 6.20817 25.7124 7.54132 26.4739 9C25.7125 10.4588 24.7316 11.7919 23.5655 12.9529H23.5608ZM13.7366 3.78947C12.706 3.78947 11.6986 4.09507 10.8417 4.66761C9.98487 5.24015 9.31703 6.05392 8.92266 7.00602C8.52828 7.95812 8.4251 9.00578 8.62615 10.0165C8.8272 11.0273 9.32345 11.9557 10.0522 12.6844C10.7809 13.4131 11.7093 13.9094 12.72 14.1104C13.7308 14.3115 14.7784 14.2083 15.7305 13.8139C16.6826 13.4195 17.4964 12.7517 18.0689 11.8948C18.6415 11.0379 18.9471 10.0305 18.9471 9C18.9455 7.61856 18.396 6.29416 17.4192 5.31733C16.4424 4.34051 15.118 3.79104 13.7366 3.78947ZM13.7366 13.2632C12.8934 13.2632 12.0691 13.0131 11.3681 12.5447C10.667 12.0762 10.1206 11.4104 9.79791 10.6314C9.47524 9.85245 9.39082 8.99527 9.55531 8.1683C9.71981 7.34133 10.1258 6.58171 10.722 5.98549C11.3183 5.38928 12.0779 4.98325 12.9049 4.81876C13.7318 4.65426 14.589 4.73869 15.368 5.06136C16.147 5.38402 16.8128 5.93044 17.2812 6.63152C17.7497 7.33259 17.9997 8.15683 17.9997 9C17.9997 10.1307 17.5506 11.215 16.7511 12.0145C15.9516 12.814 14.8672 13.2632 13.7366 13.2632Z" fill="#A4A4A4"/>
                                        </svg>
                                        <span>
                                    <?php if (function_exists('the_views')) {
                                        the_views();
                                    }  ?>
                                </span>
                                    </div>
                                </div>
                            </div>
                        </a>
                        <?php
                    }

                    // Відновлення оригінального query та скидання налаштувань
                    wp_reset_postdata();
                }
                ?>
        </div>
        <div class="blog__pagination">
                <?php
                echo paginate_links(array(
                    'end_size' => 1,
                    'min_size' => 1,
                    'next_text' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M11.9234 5.68459L17.1749 11.0162L6.00002 11.0162L6.00002 11.9838L17.1749 11.9838L11.9234 17.3154L12.5977 18L19 11.5L12.5977 5L11.9234 5.68459Z" fill="#6D6D6D"/>
                            </svg>',
                    'prev_text' => '<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12.0766 5.68459L6.82515 11.0162L18 11.0162L18 11.9838L6.82515 11.9838L12.0766 17.3154L11.4023 18L5 11.5L11.4023 5L12.0766 5.68459Z" fill="#6D6D6D"/>
                            </svg>'
                ));
                wp_reset_query(); // сброс $wp_query
                ?>
        </div>
    </div>
</section>
<?php
get_footer();
